MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F051K8/mcu.h
    /* sampling time register */
    union
    {
        __IOM uint32_t SMPTIM;

        struct
        {
            __IOM uint32_t SMPCYCSEL  : 3;
            __IM  uint32_t RESERVED1  : 29;
        } SMPTIM_B;
    } ;
    __IM  uint32_t  RESERVED[2];

    /* watchdog threshold register */
    union
    {
        __IOM uint32_t AWDT;

        struct
        {
            __IOM uint32_t AWDLT      : 12;
            __IM  uint32_t RESERVED1  : 4;
            __IOM uint32_t AWDHT      : 12;
            __IM  uint32_t RESERVED2  : 4;
        } AWDT_B;
    } ;
    __IM  uint32_t  RESERVED1;

    /* channel selection register */
    union
    {
        __IOM uint32_t CHSEL;

        struct
        {
            __IOM uint32_t CH0SEL     : 1;
            __IOM uint32_t CH1SEL     : 1;
            __IOM uint32_t CH2SEL     : 1;
            __IOM uint32_t CH3SEL     : 1;
            __IOM uint32_t CH4SEL     : 1;
            __IOM uint32_t CH5SEL     : 1;
            __IOM uint32_t CH6SEL     : 1;
            __IOM uint32_t CH7SEL     : 1;
            __IOM uint32_t CH8SEL     : 1;
            __IOM uint32_t CH9SEL     : 1;
            __IOM uint32_t CH10SEL    : 1;
            __IOM uint32_t CH11SEL    : 1;
            __IOM uint32_t CH12SEL    : 1;
            __IOM uint32_t CH13SEL    : 1;
            __IOM uint32_t CH14SEL    : 1;
            __IOM uint32_t CH15SEL    : 1;
            __IOM uint32_t CH16SEL    : 1;
            __IOM uint32_t CH17SEL    : 1;
            __IOM uint32_t CH18SEL    : 1;
            __IM  uint32_t RESERVED1  : 13;
        } CHSEL_B;
    } ;
    __IM  uint32_t  RESERVED2[5];

    /* data register */
    union
    {
        __IM  uint32_t DATA;

        struct
        {
            __IM  uint32_t DATA       : 16;
            __IM  uint32_t RESERVED1  : 16;
        } DATA_B;
    } ;
    __IM  uint32_t  RESERVED3[177];

    /* common configuration register */
    union
    {
        __IOM uint32_t CCFG;

        struct
        {
            __IM  uint32_t RESERVED1  : 22;
            __IOM uint32_t VREFEN     : 1;
            __IM  uint32_t RESERVED2  : 1;
            __IOM uint32_t VBATEN     : 1;
            __IM  uint32_t RESERVED3  : 7;
        } CCFG_B;
    } ;
} ADC_T;

/**
  * @brief HDMI-CEC registers (CEC)
  */

typedef struct
{
    /* Control register */
    union
    {
        __IOM uint32_t CTRL;

        struct
        {
            __IOM uint32_t CECEN      : 1;
            __IOM uint32_t TXSM       : 1;
            __IOM uint32_t TXEM       : 1;
            __IM  uint32_t RESERVED1  : 29;
        } CTRL_B;
    } ;

    /* Configuration register */
    union
    {
        __IOM uint32_t CFG;

        struct
        {
            __IOM uint32_t SFTCFG     : 3;
            __IOM uint32_t RXTCFG     : 1;
            __IOM uint32_t RXSBRERR   : 1;
            __IOM uint32_t GEBRERR    : 1;
            __IOM uint32_t GELBPERR   : 1;
            __IOM uint32_t AEBGIB     : 1;
            __IOM uint32_t SFTOB      : 1;
            __IM  uint32_t RESERVED1  : 7;
            __IOM uint32_t OACFG      : 15;
            __IOM uint32_t LMODSEL    : 1;
        } CFG_B;
    } ;

    /* Tx data register */
    union
    {
        __OM  uint32_t TXDATA;

        struct
        {
            __OM  uint32_t TXDATA     : 8;
            __IM  uint32_t RESERVED1  : 24;
        } TXDATA_B;
    } ;

    /* Rx data register */
    union
    {
        __IM  uint32_t RXDATA;

        struct
        {
            __IM  uint32_t RXDATA     : 8;
            __IM  uint32_t RESERVED1  : 24;
        } RXDATA_B;
    } ;

    /* Interrupt and Status Register */
    union
    {
        __IOM uint32_t STS;

        struct
        {
            __IOM uint32_t RXBREFLG   : 1;
            __IOM uint32_t RXEFLG     : 1;
            __IOM uint32_t RXOVRFLG   : 1;
            __IOM uint32_t RXBRERRFLG : 1;
            __IOM uint32_t RXSBPEFLG  : 1;
            __IOM uint32_t RXLBPEFLG  : 1;
            __IOM uint32_t RXMACKFLG  : 1;
            __IOM uint32_t ARBLOSFLG  : 1;
            __IOM uint32_t TXBREFLG   : 1;
            __IOM uint32_t TXEFLG     : 1;
            __IOM uint32_t TXBUFLG    : 1;
            __IOM uint32_t TXERRFLG   : 1;
            __IOM uint32_t TXMACKFLG  : 1;
            __IM  uint32_t RESERVED1  : 19;
        } STS_B;
    } ;

    /* interrupt enable register */
    union
    {
        __IOM uint32_t INTEN;

        struct
        {
            __IOM uint32_t RXBREIEN   : 1;
            __IOM uint32_t RXEIEN     : 1;
            __IOM uint32_t RXOVRIEN   : 1;
            __IOM uint32_t RXBRERRIEN : 1;
            __IOM uint32_t RXSBPEIEN  : 1;
            __IOM uint32_t RXLBPEIEN  : 1;
            __IOM uint32_t RXMACKIEN  : 1;
            __IOM uint32_t ARBLOSIEN  : 1;
            __IOM uint32_t TXBREIEN   : 1;
            __IOM uint32_t TXIEN      : 1;
            __IOM uint32_t TXBUIEN    : 1;
            __IOM uint32_t TXERRIEN   : 1;
            __IOM uint32_t TXMACKIEN  : 1;
            __IM  uint32_t RESERVED1  : 19;
        } INTEN_B;
    } ;
} CEC_T;

/**
  * @brief Cyclic redundancy check calculation unit (CRC)
  */

typedef struct
{
    /* Data register */
    union
    {
        __IOM uint32_t DATA;

        struct
        {
            __IOM uint32_t DATA       : 32;
        } DATA_B;
    } ;

    /* Independent data register */
    union
    {
        __IOM uint32_t INDATA;

        struct
        {
            __IOM uint32_t INDATA     : 8;
            __IM  uint32_t RESERVED1  : 24;
        } INDATA_B;
    } ;

    /* Control register */
    union
    {
        __IOM uint32_t CTRL;

        struct
        {
            __IOM uint32_t RST        : 1;
            __IM  uint32_t RESERVED1  : 4;
            __IOM uint32_t REVI       : 2;
            __IOM uint32_t REVO       : 1;
            __IM  uint32_t RESERVED2  : 24;
        } CTRL_B;
    } ;
    __IM  uint32_t  RESERVED;

    /* Initial CRC value */
    union
    {
        __IOM uint32_t INITVAL;

        struct
        {
            __IOM uint32_t VALUE      : 32;
        } INITVAL_B;
    } ;
} CRC_T;

/**
  * @brief Comparator (COMP)
  */

typedef struct
{
    /* control and status register */
    union
    {
        __IOM uint32_t CSTS;

        struct
        {
            __IOM uint32_t EN1        : 1;
            __IOM uint32_t SW1        : 1;
            __IOM uint32_t MOD1       : 2;
            __IOM uint32_t INVINSEL1  : 3;
            __IM  uint32_t RESERVED1  : 1;
            __IOM uint32_t OUTSEL1    : 3;
            __IOM uint32_t OPINV1     : 1;
            __IOM uint32_t HYSCFG1    : 2;
            __IM  uint32_t OUTSTS1    : 1;
            __IOM uint32_t LOCK1      : 1;
            __IOM uint32_t EN2        : 1;
            __IM  uint32_t RESERVED2  : 1;
            __IOM uint32_t MOD2       : 2;
            __IOM uint32_t INVINSEL2  : 3;
            __IOM uint32_t WMODEN     : 1;
            __IOM uint32_t OUTSEL2    : 3;
            __IOM uint32_t OPINV2     : 1;
            __IOM uint32_t HYSCFG2    : 2;
            __IM  uint32_t OUTSTS2    : 1;
            __IOM uint32_t LOCK2      : 1;
        } CSTS_B;
    } ;
} COMP_T;

/**
  * @brief Digital-to-Analog converter (DAC)
  */

typedef struct
{
    /* Control register */
    union
    {
        __IOM uint32_t CTRL;

        struct
        {
            __IOM uint32_t ENCH1      : 1;
            __IOM uint32_t BUFFDCH1   : 1;
            __IOM uint32_t TRGENCH1   : 1;
            __IOM uint32_t TRGSELCH1  : 3;
            __IM  uint32_t RESERVED1  : 6;
            __IOM uint32_t DMAENCH1   : 1;
            __IOM uint32_t DMAUDRIEN1 : 1;
            __IM  uint32_t RESERVED2  : 18;
        } CTRL_B;
    } ;

    /* Software trigger register */
    union
    {
        __OM  uint32_t SWTRG;

        struct
        {
            __OM  uint32_t SWTRG1     : 1;
            __IM  uint32_t RESERVED1  : 31;
        } SWTRG_B;
    } ;

    /* Channel1 12-bit right-aligned data holding register */
    union
    {
        __IOM uint32_t DH12R1;

        struct
        {
            __IOM uint32_t DATA       : 12;
            __IM  uint32_t RESERVED1  : 20;
        } DH12R1_B;
    } ;

    /* Channel1 12-bit left-aligned data holding register */
    union
    {
        __IOM uint32_t DH12L1;

        struct
        {
            __IM  uint32_t RESERVED1  : 4;
            __IOM uint32_t DATA       : 12;
            __IM  uint32_t RESERVED2  : 16;
        } DH12L1_B;
    } ;

